# SQL
Коронавирус застал мир врасплох, изменив привычный порядок вещей. В свободное время жители городов больше не выходят на улицу, не посещают кафе и торговые центры. Зато стало больше времени для книг. Это заметили стартаперы — и бросились создавать приложения для тех, кто любит читать.

Ваша компания решила быть на волне и купила крупный сервис для чтения книг по подписке. Ваша первая задача как аналитика — проанализировать базу данных.
В ней — информация о книгах, издательствах, авторах, а также пользовательские обзоры книг. Эти данные помогут сформулировать ценностное предложение для нового продукта.

### Описание данных

**Таблица `books`**

Содержит данные о книгах:

- `book_id` — идентификатор книги;
- `author_id` — идентификатор автора;
- `title` — название книги;
- `num_pages` — количество страниц;
- `publication_date` — дата публикации книги;
- `publisher_id` — идентификатор издателя.

**Таблица `authors`**

Содержит данные об авторах:

- `author_id` — идентификатор автора;
- `author` — имя автора.

**Таблица `publishers`**

Содержит данные об издательствах:

- `publisher_id` — идентификатор издательства;
- `publisher` — название издательства;

**Таблица `ratings`**

Содержит данные о пользовательских оценках книг:

- `rating_id` — идентификатор оценки;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, оставившего оценку;
- `rating` — оценка книги.

**Таблица `reviews`**

Содержит данные о пользовательских обзорах на книги:

- `review_id` — идентификатор обзора;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, написавшего обзор;
- `text` — текст обзора.

In [1]:
# импортируем библиотеки 
import pandas as pd 
from sqlalchemy import create_engine 
# устанавливаем параметры 
db_config = {'user': 'praktikum_student', # имя пользователя 
                     'pwd': 'Sdf4$2;d-d30pp', # пароль 
                     'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net', 
                     'port': 6432, # порт подключения 
                     'db': 'data-analyst-final-project-db'} # название базы данных 
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'], 
                                                                                    db_config['pwd'], 
                                                                         db_config['host'], 
                                                                                    db_config['port'], 
                                                                                    db_config['db']) 
# сохраняем коннектор 
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

## Цели исследования 

Целью нашего исследования является первичный анализ информации о книгах, издательствах, авторах, а также пользовательские обзоры книг.  На основе этих данных можно сформулировать ценностное предложение для нового продукта.


## Исследовательский анализ данных

Для начала давайте посмотрим на содержание наших таблиц.

In [16]:
 query = ''' SELECT * 
            FROM books
            LIMIT 5'''
pd.io.sql.read_sql(query, con = engine)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [3]:
query = ''' SELECT * 
            FROM authors 
            LIMIT 5 '''   
pd.io.sql.read_sql(query, con = engine)

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [4]:
query = ''' SELECT * 
            FROM publishers 
            LIMIT 5 '''   
pd.io.sql.read_sql(query, con = engine)

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

In [5]:
query = ''' SELECT * 
            FROM ratings 
            LIMIT 5 '''   
pd.io.sql.read_sql(query, con = engine)

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [6]:
query = ''' SELECT * 
            FROM reviews 
            LIMIT 5 '''   
pd.io.sql.read_sql(query, con = engine)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

## Сколько книг вышло после 1 января 2000 года;

In [7]:
query = ''' SELECT COUNT(DISTINCT book_id) AS number_of_books
            FROM books
            WHERE publication_date >= '2000-01-01' ''' 
pd.io.sql.read_sql(query, con = engine)

   number_of_books
0              821

In [8]:
query = ''' SELECT COUNT(DISTINCT book_id) AS number_of_books
            FROM books
            ''' 
pd.io.sql.read_sql(query, con = engine)

   number_of_books
0             1000

После 1 января 2020 года вышло 819 книг. Это большая часть всех существующих в магазине книг, так как всего было выпущено всего 1000 книг. Видимо пандемия хорошо влияет на творческие порывы писателей, надеемся, что они продолжат в том же духе.

## Для каждой книги посчитайте количество обзоров и среднюю оценку

In [13]:
query='''SELECT 
        books.title AS name,
        COUNT(DISTINCT reviews.review_id) AS number_reviews,
        AVG(ratings.rating) AS average_rating
        FROM
        books
        FULL OUTER  JOIN reviews ON reviews.book_id = books.book_id
        FULL OUTER JOIN ratings ON ratings.book_id = books.book_id
        GROUP BY 
        books.title
            '''
pd.io.sql.read_sql(query, con = engine)

,name,number_reviews,average_rating
0,'Salem's Lot,2,3.666667
1,1 000 Places to See Before You Die,1,2.500000
2,13 Little Blue Envelopes (Little Blue Envelope...,3,4.666667
3,1491: New Revelations of the Americas Before C...,2,4.500000
4,1776,4,4.000000
...,...,...,...
994,Wyrd Sisters (Discworld #6; Witches #2),3,3.666667
995,Xenocide (Ender's Saga #3),3,3.400000
996,Year of Wonders,4,3.200000
997,You Suck (A Love Story #2),2,4.500000
998,Zen and the Art of Motorcycle Maintenance: An ...,4,3.833333

У книги "Мемуары Гейши" много  отзывов -8, и достаточно хороший рейтинг, 4,1. Так же видно, что у книг с рейтингом 5.0 чаще всего отзывов не так много, 2-3. Книга с самым низким рейтингом - "Урожай сердца". Существуют книги с абсолютно разными рейтингами и количествами отзывов. Наиболее популярна и любима публикой художественная литература и научпоп. Так же клиенты любят циклы книг по типу "Песнь льда и пламени".


    
В данных есть дубль по книге «Мемуары Гейши» (разные издательства)

## Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры;

In [10]:
query='''SELECT 
            publishers.publisher AS name,
            COUNT(books.num_pages>50) AS number_of_books
        FROM
            books
            INNER JOIN publishers ON publishers.publisher_id = books.publisher_id
        GROUP BY 
            publishers.publisher
        ORDER BY
            number_of_books DESC
        LIMIT 1
        '''
pd.io.sql.read_sql(query, con = engine)

            name  number_of_books
0  Penguin Books               42

Самое продуктивное издательство -  "Penguin Books". Они выпустили 42 книги.

## Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками;

In [11]:
query='''SELECT 
            authors.author AS author_name,
            
            AVG(ratings.rating) AS avg_rating
        FROM
            books
            INNER JOIN ratings ON ratings.book_id = books.book_id
            INNER JOIN authors ON authors.author_id = books.author_id
        WHERE authors.author_id IN(
            SELECT books.author_id
            FROM books 
            WHERE books.book_id in (
                SELECT ratings.book_id
                FROM ratings 
                GROUP  BY ratings.book_id
                HAVING count(ratings.rating_id) > 50)) 
        GROUP BY authors.author, authors.author_id
        ORDER BY avg_rating DESC
        LIMIT 1

        '''
pd.io.sql.read_sql(query, con = engine)

                  author_name  avg_rating
0  J.K. Rowling/Mary GrandPré    4.288462

Самым популярным автором является J.K. Rowling/Mary GrandPré, средний рейтинг у них 4,29. Джоан Роулинг работала с Мари над серией про Гарри Поттера, этот цикл был и отстается очень популярным среди читателей абсолютно разного возраста.

## Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.

In [12]:
query='''SELECT         
                SUM(Sub_table.count_reviews)/COUNT(Sub_table.count_reviews) AS avg_count

        FROM(    
            SELECT reviews.username, 
            COUNT(reviews.username) AS count_reviews
        FROM reviews
        WHERE reviews.username IN (
                                SELECT ratings.username
                                FROM ratings
                                GROUP BY ratings.username
                                HAVING COUNT(ratings.rating_id) > 50
    
                                )
    GROUP BY username) AS Sub_table

        '''
pd.io.sql.read_sql(query, con = engine)

   avg_count
0  24.333333

В среднем количество обзоров от активных пользователей - 24,3. Это достаточно много. Немногие любят оставлять отзывы, но это помогает другим читателям выбрать новую книгу для покупки.

## Вывод


Глядя на результаты наших исследований можно выявить самых популярных авторов, книг и издательств. Эту информацию можно использовать для рекламы и рекомендаций. Так же автор с самой высокой средней оценкой можно считать по-настоящему популярным, ведь его оценили больше 50 людей. Книги, написанные популярными авторами можно вынести в отдельную таблицу 


Таблица best_author_ever, в ней лежит список авторов с самой выской средней оценкой, так как у этих авторов учтены книги которые имеют больше 50 пользовательских оценок, то эти оценки можно считать "правдивыми". Обязательно нужно включить книги этих авторов, а в таблице ratings_reviews, как раз есть книги со средней оценкой и пользовательскими обзорами, стоит обратить внимание на книги, где кол-во обзоров больше 3, так как достаточно много завышенных оценок с 2 обзорами . Так же среднее количество текстовых обзоров на книги более чем 50 оценками имеют в среднем 24 текстовых обзора, что будет достаточно информативно для будущих пользователей.